{"2023-05-18":"What is something small that makes your day?",
"2023-05-19":"What does your partner do that makes you feel physically or emotionally safe?",
"2023-05-20":"Is there anything that you want to feel more appreciated for?",
"2023-05-21":"When do you feel the most attractive?",
"2023-05-22":"What brings you the most pleasure in you and your partner's sex life?",
"2023-05-23":"How can you tell when your partner is angry? What is it like for you?",
"2023-05-24":"When do you feel the most connected to your partner?",
"2023-05-25":"In what areas do you think you and your partner are different and in what areas do you think you are similar?",
"2023-05-26":"What’s the first word that comes to your mind when you think of the current climate of you and your partner's relationship? Why?",
"2023-05-27":"What do you think is key for healthy communication to exist?",
"2023-05-28":"What do you think are the three most important factors for a successful relationship?",
"2023-05-29":"What made you fall in love with your partner?",
"2023-05-30":"What’s your favorite memory of you and your partner? Why?",
"2023-05-31":"What’s your favorite picture of your partner? Why?",
"2023-06-01":"What does your ideal romantic life look like in the future?",
"2023-06-02":"What’s the biggest lesson you learned from a previous partner?",
"2023-06-03":"What’s a relationship that you idolize? Why?",
"2023-06-04":"How would you describe your partner to a stranger?",
"2023-06-05":"What’s something you want to ask your partner but might be afraid to ask?",
"2023-06-06":"What do you find sexiest about your partner?",
"2023-06-07":"Who is more inclined to be jealous, you or your partner?",
"2023-06-08":"What's the first thing you noticed about your partner?",
"2023-06-09":"What's the first thing you found attractive about your partner?",
"2023-06-10":"Do you have any pet peeves that your partner should know about?",
"2023-06-11":"How do you express anger and how can your partner help when you are feeling angry?",
"2023-06-12":"How do you define great sex?",
"2023-06-13":"What type of outfit or clothes do you find sexy that you'd like to see your partner in?",
"2023-06-14":"What song makes you think of your partner?",
"2023-06-15":"What animal would you choose to be in another life? What animal do you think your partner would be?",
"2023-06-16":"What place do you love that you would want to show your partner one day?",
"2023-06-17":"What do you look forward to experiencing with your partner?",
"2023-06-18":"When did you first know that you loved your partner?",
"2023-06-19":"What is something that you admire about your partner?",
"2023-06-20":"What makes you feel more connected to your partner? What drains you in a relationship?",
"2023-06-21":"When was the last time you bragged about your partner? To whom? Why?",
"2023-06-22":"What would you do to impress your partner’s parent(s)? What could your partner do to impress your parent(s)?",
"2023-06-23":"What lessons have you learned from your parents' relationship?",
"2023-06-24":"What would you do differently from your parents in your relationship?",
"2023-06-25":"What three things do you and your partner have in common? What are three differences between you?",
"2023-06-26":"Your partner has had a rough day. What do you do to help them feel better?",
"2023-06-27":"How would you take care of your partner if they were sick?",
"2023-06-28":"Do you have a 'type' that you look for in a romantic partner? Does your partner fit this definition?",
"2023-06-29":"What is the best gift that your partner could give you?",
"2023-06-30":"Describe a time you felt immense attraction towards your partner.",
"2023-07-01":"Why did your last relationship end, and what did you learn from the breakup?",
"2023-07-02":"Describe a time you felt especially loved by your partner.",
"2023-07-03":"How could your partner be able to tell if you are not in a good mood, what can they do to help?",
"2023-07-04":"What is something that your partner can do to give you reassurance when you are feeling relationship anxiety?",
"2023-07-05":"What’s one thing on your bucket list that you and your partner can do together in the next year?",
"2023-07-06":"How would you deal with an argument/disagreement with your partner?",
"2023-07-07":"What is the best gift that you have received from your partner? What is something that you would really love to receive as a gift from them?",
"2023-07-08":"What is something your partner has done that you are proud of?",
"2023-07-09":"How do you support your partner? How do they support you?",
"2023-07-10":"What is one thing your partner can do to make you feel more loved?",
"2023-07-11":"What is one thing your partner does that makes you feel especially loved?",
"2023-07-12":"What is one thing your partner does that makes you especially love them?"
}

